// Вывести квадрат числа

Console.WriteLine("Введите число: ");
int num = int.Parse(Console.ReadLine());
int square = num * num;
Console.WriteLine($"Квадрат числа {num} = {square}");